# Import Pandas

In [1]:
input_file = "fortune500_python_practice.csv"
output_file = "business_fortune500.csv"

In [2]:
import pandas as pd

In [3]:
fortune_data = pd.read_csv(input_file)

In [4]:
fortune_data.head()

   Year  Rank           Company  Revenue (in millions) Profit (in millions)
0  1955     1    General Motors                 9823.5                  806
1  1955     2       Exxon Mobil                 5661.4                584.8
2  1955     3        U.S. Steel                 3250.4                195.4
3  1955     4  General Electric                 2959.1                212.6
4  1955     5            Esmark                 2510.8                 19.1

# LEN - gives you number of rows in a data

In [5]:
len(fortune_data)

25500

In [6]:
len(fortune_data.columns)

5

In [7]:
fortune_data.tail()

,Year,Rank,Company,Revenue (in millions),Profit (in millions)
25495,2005,496,Wm. Wrigley Jr.,3648.6,493
25496,2005,497,Peabody Energy,3631.6,175.4
25497,2005,498,Wendy's International,3630.4,57.8
25498,2005,499,Kindred Healthcare,3616.6,70.6
25499,2005,500,Cincinnati Financial,3614.0,584

In [8]:
fortune_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25500 entries, 0 to 25499
Data columns (total 5 columns):
Year                     25500 non-null int64
Rank                     25500 non-null int64
Company                  25500 non-null object
Revenue (in millions)    25500 non-null float64
Profit (in millions)     25500 non-null object
dtypes: float64(1), int64(2), object(2)
memory usage: 996.2+ KB

In [9]:
fortune_data.describe()

              Year          Rank  Revenue (in millions)
count  25500.00000  25500.000000           25500.000000
mean    1980.00000    250.499765            4273.329635
std       14.71989    144.339963           11351.884979
min     1955.00000      1.000000              49.700000
25%     1967.00000    125.750000             362.300000
50%     1980.00000    250.500000            1019.000000
75%     1993.00000    375.250000            3871.000000
max     2005.00000    500.000000          288189.000000

In [10]:
fortune_data.describe().transpose

<bound method DataFrame.transpose of               Year          Rank  Revenue (in millions)
count  25500.00000  25500.000000           25500.000000
mean    1980.00000    250.499765            4273.329635
std       14.71989    144.339963           11351.884979
min     1955.00000      1.000000              49.700000
25%     1967.00000    125.750000             362.300000
50%     1980.00000    250.500000            1019.000000
75%     1993.00000    375.250000            3871.000000
max     2005.00000    500.000000          288189.000000>

In [11]:
fortune_data.head()

   Year  Rank           Company  Revenue (in millions) Profit (in millions)
0  1955     1    General Motors                 9823.5                  806
1  1955     2       Exxon Mobil                 5661.4                584.8
2  1955     3        U.S. Steel                 3250.4                195.4
3  1955     4  General Electric                 2959.1                212.6
4  1955     5            Esmark                 2510.8                 19.1

In [12]:
fortune_data.columns

Index(['Year', 'Rank', 'Company', 'Revenue (in millions)',
       'Profit (in millions)'],
      dtype='object')

# Change COLUMN NAME

In [13]:
fortune_data.columns = ['Year', 'Position', 'Company', 'Revenue (in millions)',
       'Profit (in millions)']

In [14]:
fortune_data.columns

Index(['Year', 'Position', 'Company', 'Revenue (in millions)',
       'Profit (in millions)'],
      dtype='object')

# How to subset rows, columns and combine the two

# ROWS

In [15]:
fortune_data[::1].head()

,Year,Position,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806
1,1955,2,Exxon Mobil,5661.4,584.8
2,1955,3,U.S. Steel,3250.4,195.4
3,1955,4,General Electric,2959.1,212.6
4,1955,5,Esmark,2510.8,19.1

In [16]:
fortune_data[1:10:1]

,Year,Position,Company,Revenue (in millions),Profit (in millions)
1,1955,2,Exxon Mobil,5661.4,584.8
2,1955,3,U.S. Steel,3250.4,195.4
3,1955,4,General Electric,2959.1,212.6
4,1955,5,Esmark,2510.8,19.1
5,1955,6,Chrysler,2071.6,18.5
6,1955,7,Armour,2056.1,1.6
7,1955,8,Gulf Oil,1705.3,182.8
8,1955,9,Mobil,1703.6,183.8
9,1955,10,DuPont,1687.7,344.4

In [17]:
fortune_data.head()

,Year,Position,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806
1,1955,2,Exxon Mobil,5661.4,584.8
2,1955,3,U.S. Steel,3250.4,195.4
3,1955,4,General Electric,2959.1,212.6
4,1955,5,Esmark,2510.8,19.1

In [18]:
fortune_data[1:100:10]

,Year,Position,Company,Revenue (in millions),Profit (in millions)
1,1955,2,Exxon Mobil,5661.4,584.8
11,1955,12,Bethlehem Steel,1660.3,117.2
21,1955,22,Navistar International,994.1,36.3
31,1955,32,Uniroyal,782.6,28
41,1955,42,Rockwell Automation,645.8,22.2
51,1955,52,AMAX,509.5,43.1
61,1955,62,Anaconda,461.1,26.7
71,1955,72,NL Industries,419.3,36.6
81,1955,82,Nabisco Brands,376.4,19.9
91,1955,92,Hormel Foods,331.8,1.8

# Reverse Data Frame

In [19]:
fortune_data[::-1].head()

# prints data in reverse order

,Year,Position,Company,Revenue (in millions),Profit (in millions)
25499,2005,500,Cincinnati Financial,3614.0,584
25498,2005,499,Kindred Healthcare,3616.6,70.6
25497,2005,498,Wendy's International,3630.4,57.8
25496,2005,497,Peabody Energy,3631.6,175.4
25495,2005,496,Wm. Wrigley Jr.,3648.6,493

In [20]:
fortune_data[::20].head()

,Year,Position,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806
20,1955,21,Sinclair Oil,1021.5,91.6
40,1955,41,General Dynamics,648.6,20.8
60,1955,61,Intl. Business Machines,461.4,46.5
80,1955,81,BorgWarner,380.3,24.5

# COLUMNS

In [21]:
fortune_data.columns

Index(['Year', 'Position', 'Company', 'Revenue (in millions)',
       'Profit (in millions)'],
      dtype='object')

In [22]:
fortune_data.head()

,Year,Position,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806
1,1955,2,Exxon Mobil,5661.4,584.8
2,1955,3,U.S. Steel,3250.4,195.4
3,1955,4,General Electric,2959.1,212.6
4,1955,5,Esmark,2510.8,19.1

# # for slicing rows - we use numbers 

# for slicing columns - we use columns name

In [23]:
# to see two columns in data frame - two brackets - one for list and one for the fortune_data

In [24]:
fortune_data[['Year', 'Position']].head()

   Year  Position
0  1955         1
1  1955         2
2  1955         3
3  1955         4
4  1955         5

In [25]:
fortune_data[['Year', 'Position']].head()

   Year  Position
0  1955         1
1  1955         2
2  1955         3
3  1955         4
4  1955         5

In [26]:
# FOR COLUMNS - one square bracket is for the list and one is for the variable - as u put the list inside the variable

In [27]:
fortune_data['Year'].head()

0    1955
1    1955
2    1955
3    1955
4    1955
Name: Year, dtype: int64

In [28]:
# for showing only 1 column, you can just put it inside the variable brackets, as you dont need an extra bracket like above - as there is no list but only one column u want to display

# QUICK ACCESS

In [29]:
fortune_data.Year.head()

0    1955
1    1955
2    1955
3    1955
4    1955
Name: Year, dtype: int64

In [30]:
# required the name to be one word

# COMBINING ROWS AND COLUMNS

In [31]:
fortune_data[4:8][['Year', 'Position']]

   Year  Position
4  1955         5
5  1955         6
6  1955         7
7  1955         8

In [32]:
# it sliced rows 4 to 8 and gave us year and position - doesnt matter if u write rows first or the columns

In [33]:
fortune_data[['Year', 'Position']][4:8]

   Year  Position
4  1955         5
5  1955         6
6  1955         7
7  1955         8

# BASIC OPERATIONS DATA FRAME

In [34]:
fortune_data.head()

,Year,Position,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806
1,1955,2,Exxon Mobil,5661.4,584.8
2,1955,3,U.S. Steel,3250.4,195.4
3,1955,4,General Electric,2959.1,212.6
4,1955,5,Esmark,2510.8,19.1

In [35]:
fortune_data.columns

Index(['Year', 'Position', 'Company', 'Revenue (in millions)',
       'Profit (in millions)'],
      dtype='object')

In [36]:
fortune_data[['Year', 'Position', 'Company','Revenue (in millions)',
       'Profit (in millions)']][1:10]

,Year,Position,Company,Revenue (in millions),Profit (in millions)
1,1955,2,Exxon Mobil,5661.4,584.8
2,1955,3,U.S. Steel,3250.4,195.4
3,1955,4,General Electric,2959.1,212.6
4,1955,5,Esmark,2510.8,19.1
5,1955,6,Chrysler,2071.6,18.5
6,1955,7,Armour,2056.1,1.6
7,1955,8,Gulf Oil,1705.3,182.8
8,1955,9,Mobil,1703.6,183.8
9,1955,10,DuPont,1687.7,344.4

In [37]:
# above you are subsetting certain columns and certain rows in data frames

# MATHEMATICAL OPERATIONS

In [38]:
# You can add, divide, subtract, multiply - perform any function

In [39]:
result_of_multiplication = fortune_data.Year * fortune_data.Position

In [40]:
result_of_multiplication.head()

0    1955
1    3910
2    5865
3    7820
4    9775
dtype: int64

In [41]:
# The above columns are just for practice - [year * position] - as I could not multiply revenue and profit column becuase of the IN operator in the columns

In [42]:
result_of_division = fortune_data.Year / fortune_data.Position

In [43]:
result_of_division.head()

0    1955.000000
1     977.500000
2     651.666667
3     488.750000
4     391.000000
dtype: float64

# ADD COLUMN TO DATA FRAME

In [44]:
fortune_data['MyCalc'] = fortune_data.Year * fortune_data.Position

In [45]:
fortune_data['MyCalc'].head()

0    1955
1    3910
2    5865
3    7820
4    9775
Name: MyCalc, dtype: int64

In [46]:
fortune_data.columns

Index(['Year', 'Position', 'Company', 'Revenue (in millions)',
       'Profit (in millions)', 'MyCalc'],
      dtype='object')

In [47]:
# above you can see that column = MyCalc has been added to the column list

# REMOVING COLUMN

In [48]:
fortune_data.head()

,Year,Position,Company,Revenue (in millions),Profit (in millions),MyCalc
0,1955,1,General Motors,9823.5,806,1955
1,1955,2,Exxon Mobil,5661.4,584.8,3910
2,1955,3,U.S. Steel,3250.4,195.4,5865
3,1955,4,General Electric,2959.1,212.6,7820
4,1955,5,Esmark,2510.8,19.1,9775

In [49]:
fortune_data = fortune_data.drop('MyCalc',1)

In [50]:
fortune_data.head()

,Year,Position,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806
1,1955,2,Exxon Mobil,5661.4,584.8
2,1955,3,U.S. Steel,3250.4,195.4
3,1955,4,General Electric,2959.1,212.6
4,1955,5,Esmark,2510.8,19.1

In [51]:
# the above code dropped the column - MyCalc

# FILTERING DATA FRAMES

In [58]:
fortune_data.head()

,Year,Position,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806
1,1955,2,Exxon Mobil,5661.4,584.8
2,1955,3,U.S. Steel,3250.4,195.4
3,1955,4,General Electric,2959.1,212.6
4,1955,5,Esmark,2510.8,19.1

In [99]:
filter1 = fortune_data.Position < 3

In [100]:
filter1.head()

0     True
1     True
2    False
3    False
4    False
Name: Position, dtype: bool

In [96]:
fortune_data[filter1].head()

,Year,Position,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806
1,1955,2,Exxon Mobil,5661.4,584.8
500,1956,1,General Motors,12443.3,1189.5
501,1956,2,Exxon Mobil,6272.4,709.3
1000,1957,1,General Motors,10796.4,847.4

In [73]:
# the above filter shows ONLY THE ROWS THAT ARE TRUE, meaning where condition is True 
# basically, rows where filter = fortune_data.Position < 3

# LETS PRACTICE FILTERING DATA FRAMES

In [87]:
filter2 = fortune_data.Year > 1958

In [90]:
fortune_data[filter2].head()

# fortune_data[fortune_data.Year > 1958]  -----> its the same thing as the code above

,Year,Position,Company,Revenue (in millions),Profit (in millions)
2000,1959,1,General Motors,9522.0,633.6
2001,1959,2,Exxon Mobil,7543.6,562.5
2002,1959,3,Ford Motor,4130.3,95.7
2003,1959,4,General Electric,4120.8,242.9
2004,1959,5,U.S. Steel,3472.2,301.6

# INTERESTING : TWO CONDITIONS AT THE SAME TIME

In [102]:
# position is < 3 and year > 1958
# ONLY WHEN BOTH CONDITIONS ARE MET, IT WILL RETURN TRUE- POSITION < 3 AND YEAR > 1958

In [103]:
filter1 & filter2

0        False
1        False
2        False
3        False
4        False
5        False
6        False
7        False
8        False
9        False
10       False
11       False
12       False
13       False
14       False
15       False
16       False
17       False
18       False
19       False
20       False
21       False
22       False
23       False
24       False
25       False
26       False
27       False
28       False
29       False
         ...
25470    False
25471    False
25472    False
25473    False
25474    False
25475    False
25476    False
25477    False
25478    False
25479    False
25480    False
25481    False
25482    False
25483    False
25484    False
25485    False
25486    False
25487    False
25488    False
25489    False
25490    False
25491    False
25492    False
25493    False
25494    False
25495    False
25496    False
25497    False
25498    False
25499    False
Length: 25500, dtype: bool

In [112]:
fortune_data[filter1 & filter2].head()

,Year,Position,Company,Revenue (in millions),Profit (in millions)
2000,1959,1,General Motors,9522.0,633.6
2001,1959,2,Exxon Mobil,7543.6,562.5
2500,1960,1,General Motors,11233.1,873.1
2501,1960,2,Exxon Mobil,7910.7,629.8
3000,1961,1,General Motors,12736.0,959

In [114]:
fortune_data[(fortune_data.Position < 3) & (fortune_data.Year > 1958)].head()

,Year,Position,Company,Revenue (in millions),Profit (in millions)
2000,1959,1,General Motors,9522.0,633.6
2001,1959,2,Exxon Mobil,7543.6,562.5
2500,1960,1,General Motors,11233.1,873.1
2501,1960,2,Exxon Mobil,7910.7,629.8
3000,1961,1,General Motors,12736.0,959

In [115]:
fortune_data.head()

,Year,Position,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806
1,1955,2,Exxon Mobil,5661.4,584.8
2,1955,3,U.S. Steel,3250.4,195.4
3,1955,4,General Electric,2959.1,212.6
4,1955,5,Esmark,2510.8,19.1

In [117]:
top_achievers = fortune_data[fortune_data.Position == 1]

In [118]:
top_achievers.head()

,Year,Position,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806
500,1956,1,General Motors,12443.3,1189.5
1000,1957,1,General Motors,10796.4,847.4
1500,1958,1,General Motors,10989.8,843.6
2000,1959,1,General Motors,9522.0,633.6

In [120]:
fortune_data[fortune_data.Position == 1].head()

,Year,Position,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806
500,1956,1,General Motors,12443.3,1189.5
1000,1957,1,General Motors,10796.4,847.4
1500,1958,1,General Motors,10989.8,843.6
2000,1959,1,General Motors,9522.0,633.6

# FIND UNIQUE CATEGORIES FROM A COLUMN

In [124]:
# find unique year from the Year column

In [127]:
distinct_year = fortune_data.Year.unique()

In [128]:
distinct_year

array([1955, 1956, 1957, 1958, 1959, 1960, 1961, 1962, 1963, 1964, 1965,
       1966, 1967, 1968, 1969, 1970, 1971, 1972, 1973, 1974, 1975, 1976,
       1977, 1978, 1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005], dtype=int64)

# EXERCISE : FIND EVERYTHING ABOUT COMPANY GENERAL MOTORS

In [134]:
general_motors = fortune_data[fortune_data.Company == "General Motors"]

In [135]:
general_motors.head()

,Year,Position,Company,Revenue (in millions),Profit (in millions)
0,1955,1,General Motors,9823.5,806
500,1956,1,General Motors,12443.3,1189.5
1000,1957,1,General Motors,10796.4,847.4
1500,1958,1,General Motors,10989.8,843.6
2000,1959,1,General Motors,9522.0,633.6